
app.factory('data-service', [function () {
    
    Recipe r;
    var recepies = [
        {
            ID: 1,
            Title: "קציצות תירס ותרד",
            Email: "aviranabuzadka@gmail.com",
            PrepTime: "15 דקות",
            Ingridients:"תירס מתוק - קופסת שימורים (246 גרם), מסונן." +
                        "תפוח אדמה - יחידה גדולה (323 גרם), מגורד." +
                        "תרד - 400 גרם, חלוט במים חמים 5 דקות וסחוט." +
                        "בצל - יחידה בינונית (125 גרם), קצוץ דק מאוד." +
                        "ביצה - 2 Large." +
                        "מלח - 1/2 כפית שטוחה." +
                        "כורכום - 1/2 כפית שטוחה." +
                        "פלפל שחור - 1/4 כפית שטוחה." +
                        "כמון טחון - 1/4 כפית שטוחה." +
                        "קמח לבן - 2 כפות שטוחות - סה\"כ (24 גרם)." +
                        "שמן קנולה - 1/2 כוס - סה\"כ (120 מ\"ל), לטיגון.",
            Stages: 
                "1. לחלק את התירס לשני חלקים: חצי אחד להשאיר גרעיני תירס שלמים וחצי שני לרסק את גרעיני התירס ככל שאפשר." +
                "2. להוסיף את שאר המצרכים ולערבב היטב." +
                "3. להכין מהתערובת קציצות בגודל הרצוי." +
                "4. לטגן את הקציצות בשמן חם ולהניח על נייר סופג." +
                "5. להעביר לכלי הגשה נאה - מתקבלות קציצות תירס ותרד מושלמות!" +
                "6. בתיאבון (:" +
                "התבלינים במתכון לפי הטעם האישי.,",
            Level: "קל",
            Picture: "http://st1.foodsd.co.il/Images/Recipes/xxl/Recipe-8390-IGWxJDbIANDZNEiU.jpg",
            Category: "צמחוני",
            rank: 0
        },
        {
            ID: 2,
            Title: "רולדת פטריות ובצל",
            Email: "aviranabuzadka@gmail.com",
            PrepTime: "20 דקות",
            Ingridients: "הבצק" +
                        "בצק עלים - שקית (1000 גרם)" +
                        "המלית" +
                        "בצל - 3 יחידות גדולות - סה\"כ (966 גרם), פרוסים." +
                        "פטריות - 2 חבילות - סה\"כ (420 גרם), טריות ופרוסות." +
                        "שמן קנולה - 1/4 כוס - סה\"כ (60 מ\"ל), לטיגון." +
                        "מלח - 1/2 כפית שטוחה" +
                        "פלפל שחור - 1/4 כפית שטוחה" +
                        "כמון טחון - 1/4 כפית שטוחה" +
                        "הציפוי" +
                        "ביצה - Large, טרופה." +
                        "שומשום - 2 כפות - סה\"כ (24 גרם), לפיזור.",
            Stages:
                "1. לא לשכוח להפשיר את בצק העלים." +
                "2. בינתיים לטגן את הבצלים בשמן עד להזהבה." +
                "3. להוסיף את הפטריות והתבלינים, להמשיך לטגן כ- 3-4 דקות תוך כדי" +
                "ערבוב ולקרר." +
                "4. לחלק את הבצק ל- 4 חלקים ולחלק את תערובת הפטריות ל- 4 מנות שוות." +
                "5. לרדד כל חלק מהבצק לעלה, למלא חלק מתערובת הפטריות, לגלגל לרולדה, להדק היטב את הקצוות וכך להכין את שאר הרולדות." +
                "6. להניח את הרולדות על נייר אפייה בתוך תבנית, למרוח בביצה טרופה ולפזר מעל את השומשום. לאפות בחום של 180 מעלות למשך כחצי שעה או עד שהרולדות מזהיבות." +
                "7. בתיאבון (:" +
                "שיטת ההכנה כוללת גם טיגון. התבלינים במתכון לפי הטעם האישי.",
            Level: "בינוני",
            Picture: "http://st1.foodsd.co.il/Images/Recipes/xxl/Recipe-8368-dLteYOYgfxkzacIQ.jpg",
            Category: "צמחוני",
            rank: 0
        },
        {
            ID: 2,
            Title: "קיש ברוקולי ועגבניות עם גבינה בולגרית",
            Email: "diklayoni@gmail.com",
            PrepTime: "שעה",
            Ingridients: "הבצק" +
                        "חמאה - 160 גרם" +
                        "קמח לבן - 280 גרם, 2 כוסות." +
                        "מלח - קורט" +
                        "ביצה - Large" +
                        "מים - 2 כפות - סה\"כ (20 מ\"ל), קרים." +
                        "המלית" +
                        "בצל - יחידה בינונית (125 גרם), סגול או לבן (חתוך לפרוסות)." +
                        "שמן קנולה - 2 כפות - סה\"כ (20 מ\"ל), לטיגון הבצל." +
                        "תפרחות ברוקולי - 200 גרם, 2 כוסות (מוקפא)." +
                        "עגבניות שרי - 5 יחידות - סה\"כ (75 גרם), חתוכות לחצי." +
                        "בולגרית 5% שומן - 50 גרם, 1/2 כוס." +
                        "רוטב הרויאל" +
                        "קמח לבן - 2 כפות שטוחות - סה\"כ (24 גרם)" +
                        "שמנת חמוצה 9% שומן - 1/2 גביע - סה\"כ (100 מ\"ל)" +
                        "שמנת מתוקה 38% - 200 מ\"ל, כוס חד פעמית שתייה חמה." +
                        "קוטג` תנובה 3% - כף (20 גרם)" +
                        "ביצה - 2 Large" +
                        "מלח - 1/4 כפית שטוחה" +
                        "פלפל שחור - 1/4 כפית שטוחה" +
                        "מוסקט טחון - קורט (1 גרם)" +
                        "שום - 2 שיניים, כתושות.",
            Stages:
                "1. לערבל במיקסר את החמאה ביחד עם הקמח והמלח עד לקבלת תערובת פירורית. להוסיף את הביצה והמים, ולהמשיך לעבד עד שנוצר בצק." +
                "2. לרדד את הבצק לעיגול גדול במעט מגודל התבנית (ראו ציוד נדרש)." +
                "3. להניח את הבצק בתבנית ולהדק היטב לבסיס ולשוליים (ליישר את הקצוות)." +
                "4. בעזרת מזלג לחורר מעט את הבצק ולהקפיא עד שהמלית מוכנה." +
                "5. לערבב את כל מצרכי רוטב הרויאל עד שמתקבלת תערובת אחידה." +
                "6. בינתיים לטגן מעט את הבצל בשמן עד להזהבה קלה." +
                "7. לחמם את התנור מראש לחום של 170 מעלות צלזיוס." +
                "8. להוציא את הבצק מההקפאה, להניח בבסיס את הבצל המטוגן, מעל את הברוקולי המוקפא, עגבניות השרי והגבינה הבולגרית." +
                "9. למזוג מעל את רוטב הרויאל באיטיות עד לקצה התבנית. במידה ונשאר לכם מעט מהבצק הפריך ניתן להכין ממנו קישוט מעל כפי שאני הכנתי (אני הנחתי את עלי הבצק לאחר אפייה חלקית של הקיש כדי שהם לא ישקעו אל תוך הקיש)." +
                "10. לאפות את הקיש במשך כ- 45 דקות עד שמשחים קלות." +
                "11. בתיאבון (:" +
                "שיטת ההכנה כוללת גם טיגון. התבלינים במתכון לפי הטעם האישי.",
            Level: "קשה",
            Picture: "http://st1.foodsd.co.il/Images/Recipes/xxl/Recipe-8381-a8bqdxzgvWo7uMzD.jpg",
            Category: "צמחוני",
            rank: 0
        },
        {
            ID: 3,
            Title: "סלט כרוב אדום ותפוחים",
            Email: "natifridman@gmail.com",
            PrepTime: "10 דקות",
            Ingridients: "כרוב אדום - יחידה קטנה (1186 גרם), מגורד דק." +
                        "תפוח עץ עם קליפה - 2 יחידות בינוניות - סה\"כ (370 גרם), מגורדים לרצועות דקות." +
                        "אפרסמון - 2 יחידות בינוניות ללא קליפה - סה\"כ (314 גרם), קשים ומגורדים לרצועות דקות." +
                        "בצל - יחידה בינונית (125 גרם), בצל סגול חתוך לרצועות דקות." +
                        "שמן קנולה - 3 כפות - סה\"כ (30 מ\"ל)" +
                        "מיץ לימון - 1/2 יחידה - סה\"כ (15 מ\"ל), סחוט טרי." +
                        "מלח - 1/4 כפית שטוחה" +
                        "פלפל שחור - 1/4 כפית שטוחה",
            Stages:
                "1. לערבב בקערה את כל המצרכים ביחד." +
                "2. להוסיף עוד תבלינים לפי הטעם." +
                "3. להעביר לכלי הגשה נאה." +
                "4. קלי קלות - בתיאבון (:" +
                "התבלינים במתכון לפי הטעם האישי.",
            Level: "קל",
            Picture: "http://st1.foodsd.co.il/Images/Recipes/xxl/Recipe-8389-TIwcPMIRiMVWhE5d.jpg",
            Category: "טבעוני",
            rank: 0
        },
        {
            ID: 3,
            Title: "שקשוקה עם מעט שמן",
            Email: "shaharsegal@gmail.com",
            PrepTime: "20 דקות",
            Ingridients: "עגבניה - 10 יחידות בינוניות - סה\"כ (1.72 ק\"ג), בשלות וחתוכות לרצועות/קוביות." +
                        "פלפל אדום - יחידה בינונית (185 גרם), חתוך לרצועות/קוביות." +
                        "פלפל ירוק חריף - 1/2 יחידה בינונית - סה\"כ (41 גרם), אם אין - אפשר שבבי צ`ילי חריף." +
                        "שום - 2 שיניים, כתושות." +
                        "שמן זית - 2 כפות - סה\"כ (20 מ\"ל)" +
                        "ביצה - 5 Large - סה\"כ (295 גרם)" +
                        "פפריקה - 1/2 כפית שטוחה, מתוקה." +
                        "מלח - 3/4 כפית שטוחה" +
                        "קימל טחון - 1/2 כפית" +
                        "סוכר - 1/2 כפית שטוחה - סה\"כ (3 גרם)",
            Stages:
                "1. במחבת גדולה לשים עגבניות + שמן." +
                "2. להוסיף את שאר החומרים פרט לביצים." +
                "3. לערבב מדי פעם. לאחר כ- 20 דקות לשבור את הביצים שלמות לתוך הרוטב, ולהמשיך לבשל עוד כ- 10 דקות." +
                "4. כמובן אפשר להוסיף יותר שמן אבל לדעתי אין צורך. גם כך זה טעים." +
                "5. בתיאבון (:",
            Level: "בינוני",
            Picture: "http://st1.foodsd.co.il/Images/Recipes/Recipe-3968-oGwfeLnpXA.jpg",
            Category: "דיאטטי",
            rank: 0
        }

    ];
    return {
        getRecipes: function () {
            return angular.copy(recepies);
        }
    };
}]);